---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.ExtrusionTooThin
source: html/f63cc4ac-21ce-e755-d35c-dba6edf770d7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.ExtrusionTooThin Property

Extrusion is too thin.

## Syntax (C#)
```csharp
public static FailureDefinitionId ExtrusionTooThin { get; }
```